{
blacklist: ["Tilano",
            "ujykfyijhgf",
            "Benneviss",

            ],
whitelist: ["changcheng6541", 
            "xqqzldh",
            "Golaxy 9D",
            
            ],
allow_ranked: true,
decline_new_challenges: false,
max_games_per_player: 10,
hidden: false,
allowed_board_sizes: [9],
engine: "Kata_speed special trained 9*9 network",
allow_unranked: false,
farewellscore: true,
farewell: {
        en: "Thank you for the game! If you find something wrong or something annoys you, please send a private message to my manager changcheng6541. Have a nice day!",
        fr: "Merci pour la partie ! Si vous trouvez quelque chose qui ne va pas ou si quelque chose vous dérange, veuillez envoyer un message privé à mon responsable changcheng6541. Passez une bonne journée !",
        de: "Danke für das Spiel! Wenn Ihnen etwas auffällt oder etwas Sie stört, senden Sie bitte eine private Nachricht an meinen Manager changcheng6541. Einen schönen Tag noch!",
        es: "¡Gracias por el juego! Si encuentras algo que no esté bien o algo te molesta, por favor envía un mensaje privado a mi gerente changcheng6541. ¡Que tengas un buen día!",
        it: "Grazie per la partita! Se trovi qualcosa che non va o qualcosa ti infastidisce, per favore invia un messaggio privato al mio manager changcheng6541. Buona giornata!",
        ja: "ゲームありがとうございました！もし問題がある場合や何かが気になる場合は、私のマネージャー changcheng6541 にプライベートメッセージを送ってください。良い一日をお過ごしください！",
        ko: "게임 감사합니다! 문제가 있거나 불편한 점이 있으면 제 매니저 changcheng6541에게 개인 메시지를 보내주세요. 좋은 하루 되세요!",
        nl: "Bedankt voor het spel! Als je iets vindt dat niet klopt of als iets je irriteert, stuur dan een privébericht naar mijn manager changcheng6541. Fijne dag verder!",
        pl: "Dziękuję za grę! Jeśli zauważysz coś, co jest nie tak, lub coś cię irytuje, proszę wyślij prywatną wiadomość do mojego menedżera changcheng6541. Miłego dnia!",
        pt: "Obrigado pelo jogo! Se você encontrar algo de errado ou algo que o incomode, por favor envie uma mensagem privada para o meu gerente changcheng6541. Tenha um bom dia!",
        ru: "Спасибо за игру! Если вы заметите что-то не так или что-то вас раздражает, пожалуйста, отправьте личное сообщение моему менеджеру changcheng6541. Хорошего дня!",
        "zh-tw": "謝謝你的遊戲！如果你發現有任何問題或有什麼困擾，請發送私人消息給我的經理 changcheng6541。祝你有美好的一天！",
        "zh-cn": "谢谢你的游戏！如果你发现任何问题或有什么困扰，请发私人消息给我的经理 changcheng6541。祝你有美好的一天！"

    },
greeting: {
        "en": "Hello, I am Kata_speed, a specially trained 9*9 network managed by changcheng6541 and xqqzldh. I use the newest Rank detection technology by changcheng6541 to match the bot's rank with the opponent's for a better experience. Moves fast and blunder rarely, now used just for fun and training, always available on the bot list. Please do not use AI against me unless you are a verified bot account, you will be blacklisted if you do so. Have fun!",
    "fr": "Bonjour, je suis Kata_speed, un réseau 9*9 spécialement formé et géré par changcheng6541 et xqqzldh. J'utilise la technologie de détection de rang la plus récente de changcheng6541 pour ajuster le rang du bot à celui de l'adversaire pour une meilleure expérience. Je me déplace rapidement et fais rarement des erreurs, maintenant utilisé uniquement pour le plaisir et l'entraînement, toujours disponible sur la liste des robots. Veuillez ne pas utiliser d'IA contre moi à moins que vous ne soyez un compte de bot vérifié, vous serez mis sur liste noire si vous le faites. Amusez-vous !",
    "de": "Hallo, ich bin Kata_speed, ein speziell ausgebildetes 9*9-Netzwerk, das von changcheng6541 und xqqzldh verwaltet wird. Ich benutze die neueste Rang-Erkennungstechnologie von changcheng6541, um den Rang des Bots an den des Gegners anzupassen, um ein besseres Erlebnis zu bieten. Bewege mich schnell und mache selten Fehler, wird jetzt nur noch zum Spaß und zum Training verwendet, immer auf der Bot-Liste verfügbar. Bitte verwenden Sie keine KI gegen mich, es sei denn, Sie sind ein verifizierter Bot-Account, Sie werden auf die schwarze Liste gesetzt, wenn Sie dies tun. Viel Spaß!",
    "es": "Hola, soy Kata_speed, una red 9*9 especialmente capacitada y gestionada por changcheng6541 y xqqzldh. Utilizo la tecnología de detección de rangos más reciente de changcheng6541 para ajustar el rango del bot al del oponente, lo que ofrece una mejor experiencia. Me muevo rápido y rara vez cometo errores, ahora solo se usa para divertirse y entrenar, siempre disponible en la lista de bots. Por favor, no uses IA contra mí a menos que seas una cuenta de bot verificada, serás incluido en la lista negra si lo haces. ¡Diviértete!",
    "it": "Ciao, sono Kata_speed, una rete 9*9 specialmente formata e gestita da changcheng6541 e xqqzldh. Utilizzo la più recente tecnologia di rilevamento dei ranghi di changcheng6541 per adattare il rango del bot a quello dell'avversario, offrendo un'esperienza migliore. Mi muovo velocemente e sbaglio raramente, ora usato solo per divertimento e allenamento, sempre disponibile nella lista dei bot. Si prega di non usare l'IA contro di me a meno che non siate un account bot verificato, sarete inseriti nella lista nera se lo fate. Divertiti!",
    "ja": "こんにちは、私はKata_speedという特別に訓練された9*9ネットワークです。changcheng6541とxqqzldhによって管理されています。私はchangcheng6541による最新のランク検出技術を使用して、ボットのランクを対戦相手のランクに合わせることで、より良い体験を提供します。動きは速く、失敗することはめったにありません。現在は楽しみとトレーニングのためだけに使用されています。ボットリストでは常に利用可能です。私に対してAIを使用しないでください、検証されたボットアカウントでない限り、そうしないとブラックリストに載ります。楽しんでください！",
    "ko": "안녕하세요. 저는 Kata_speed라는 특수 훈련된 9*9 네트워크입니다. changcheng6541과 xqqzldh가 관리합니다. 저는 changcheng6541의 최신 랭크 감지 기술을 사용하여 봇의 랭크를 상대방의 랭크와 일치시켜 더 나은 경험을 제공합니다. 빠르게 움직이고 실수하는 경우가 거의 없으며 이제는 재미와 훈련에만 사용되며 항상 봇 목록에서 사용할 수 있습니다. 저와 함께 AI를 사용하지 마십시오. 검증된 봇 계정이 아닌 경우 블랙리스트에 올라갈 것입니다. 재미있게 보내세요!",
    "nl": "Hallo, ik ben Kata_speed, een speciaal opgeleid 9*9 netwerk beheerd door changcheng6541 en xqqzldh. Ik gebruik de nieuwste rangdetectietechnologie van changcheng6541 om de rang van de bot af te stemmen op die van de tegenstander voor een betere ervaring. Beweeg snel en maak zelden fouten, wordt nu alleen gebruikt voor plezier en training, altijd beschikbaar op de botlijst. Gebruik geen AI tegen mij, tenzij je een geverifieerd botaccount bent, je wordt op de zwarte lijst gezet als je dat doet. Veel plezier!",
    "pl": "Witam, jestem Kata_speed, specjalnie przeszkoloną siecią 9*9 zarządzaną przez changcheng6541 i xqqzldh. Używam najnowszej technologii wykrywania rang od changcheng6541, aby dopasować rangę bota do rangi przeciwnika, co zapewnia lepsze doświadczenie. Porusza się szybko i rzadko popełnia błędy, teraz używana tylko do zabawy i treningu, zawsze dostępna na liście botów. Proszę nie używać AI przeciwko mnie, chyba że masz zweryfikowane konto bota, zostaniesz umieszczony na czarnej liście, jeśli to zrobisz. Baw się dobrze!",
    "pt": "Olá, sou Kata_speed, uma rede 9*9 especialmente treinada e gerida por changcheng6541 e xqqzldh. Uso a mais recente tecnologia de detecção de classificação de changcheng6541 para ajustar a classificação do bot à do oponente, oferecendo uma melhor experiência. Movo-me rapidamente e cometo erros raramente, agora usado apenas para diversão e treinamento, sempre disponível na lista de bots. Por favor, não use IA contra mim, a menos que você seja uma conta de bot verificada, você será colocado na lista negra se fizer isso. Divirta-se!",
    "ru": "Здравствуйте, я Kata_speed, специально обученная сеть 9*9, управляемая changcheng6541 и xqqzldh. Я использую новейшую технологию определения рангов от changcheng6541, чтобы сопоставить ранг бота с рангом противника для лучшего опыта. Двигаюсь быстро и редко ошибаюсь, теперь используется только для развлечений и тренировок, всегда доступен в списке ботов. Пожалуйста, не используйте ИИ против меня, если у вас нет подтвержденной учетной записи бота, вы будете внесены в черный список, если это сделаете. Получайте удовольствие!",
    "zh-tw": "大家好，我是Kata_speed，一個由changcheng6541和xqqzldh管理的專門訓練的9*9網絡。我使用changcheng6541最新的排名檢測技術，將機器人的排名調整為與對手相同，以提供更好的體驗。移動快速且很少出錯，現在僅用於娛樂和訓練，始終在機器人列表中可用。請不要使用AI對抗我，除非您是經過驗證的機器人帳戶，否則您將被列入黑名單。玩得開心！",
    "zh-cn": "大家好，我是Kata_speed，一个由changcheng6541和xqqzldh管理的专门训练的9*9网络。我使用changcheng6541最新的排名检测技术，将机器人的排名调整为与对手相同，以提供更好的体验。移动快速且很少出错，现在仅用于娱乐和训练，始终在机器人列表中可用。请不要使用AI对抗我，除非您是经过验证的机器人账户，否则您将被列入黑名单。玩得开心！",
    }
}