{
blacklist: ["Tilano",
            "ujykfyijhgf",
            "Benneviss",

            ],
whitelist: ["changcheng6541", 
            "xqqzldh",
            "Golaxy 9D",
            
            ],
allow_ranked: true,
decline_new_challenges: false,
max_games_per_player: 10,
hidden: false,
allowed_board_sizes: [9],
engine: "Kata_speed special trained 9*9 network",
allow_unranked: false,
farewellscore: true,
farewell: {
        en: "Thank you for the game! If you find something wrong or something annoys you, please send a private message to my manager changcheng6541. Have a nice day!",
        fr: "Merci pour la partie ! Si vous trouvez quelque chose qui ne va pas ou si quelque chose vous dérange, veuillez envoyer un message privé à mon responsable changcheng6541. Passez une bonne journée !",
        de: "Danke für das Spiel! Wenn Ihnen etwas auffällt oder etwas Sie stört, senden Sie bitte eine private Nachricht an meinen Manager changcheng6541. Einen schönen Tag noch!",
        es: "¡Gracias por el juego! Si encuentras algo que no esté bien o algo te molesta, por favor envía un mensaje privado a mi gerente changcheng6541. ¡Que tengas un buen día!",
        it: "Grazie per la partita! Se trovi qualcosa che non va o qualcosa ti infastidisce, per favore invia un messaggio privato al mio manager changcheng6541. Buona giornata!",
        ja: "ゲームありがとうございました！もし問題がある場合や何かが気になる場合は、私のマネージャー changcheng6541 にプライベートメッセージを送ってください。良い一日をお過ごしください！",
        ko: "게임 감사합니다! 문제가 있거나 불편한 점이 있으면 제 매니저 changcheng6541에게 개인 메시지를 보내주세요. 좋은 하루 되세요!",
        nl: "Bedankt voor het spel! Als je iets vindt dat niet klopt of als iets je irriteert, stuur dan een privébericht naar mijn manager changcheng6541. Fijne dag verder!",
        pl: "Dziękuję za grę! Jeśli zauważysz coś, co jest nie tak, lub coś cię irytuje, proszę wyślij prywatną wiadomość do mojego menedżera changcheng6541. Miłego dnia!",
        pt: "Obrigado pelo jogo! Se você encontrar algo de errado ou algo que o incomode, por favor envie uma mensagem privada para o meu gerente changcheng6541. Tenha um bom dia!",
        ru: "Спасибо за игру! Если вы заметите что-то не так или что-то вас раздражает, пожалуйста, отправьте личное сообщение моему менеджеру changcheng6541. Хорошего дня!",
        "zh-tw": "謝謝你的遊戲！如果你發現有任何問題或有什麼困擾，請發送私人消息給我的經理 changcheng6541。祝你有美好的一天！",
        "zh-cn": "谢谢你的游戏！如果你发现任何问题或有什么困扰，请发私人消息给我的经理 changcheng6541。祝你有美好的一天！"

    },
greeting: {
        "en": "Hello, I am Kata_speed special trained 9*9 network. Managed by changcheng6541 and xqqzldh. Moves fast and blunder rarely, now used just for fun and training, always available on the bot list. Please do not use AI against me unless you are a verified bot account, you will be blacklisted if you do so. Have fun!",
        "fr": "Bonjour, je suis le réseau 9*9 spécialement formé Kata_speed. Géré par changcheng6541 et xqqzldh. Se déplace rapidement et fait rarement des erreurs, maintenant utilisé uniquement pour le plaisir et l'entraînement, toujours disponible sur la liste des robots. Veuillez ne pas utiliser d'IA contre moi à moins que vous ne soyez un compte de bot vérifié, vous serez mis sur liste noire si vous le faites. Amusez-vous!",
        "de": "Hallo, ich bin ein speziell für Kata_speed ausgebildetes 9*9-Netzwerk. Verwaltet von changcheng6541 und xqqzldh. Bewegt sich schnell und macht selten Fehler, wird jetzt nur noch zum Spaß und zum Training verwendet, ist immer auf der Bot-Liste verfügbar. Bitte verwenden Sie keine KI gegen mich, es sei denn, Sie sind ein verifizierter Bot-Account, Sie werden auf die schwarze Liste gesetzt, wenn Sie dies tun. Viel Spaß!",
        "es": "Hola, soy Kata_speed de la red 9*9 especialmente capacitada. Gestionado por changcheng6541 y xqqzldh. Se mueve rápido y rara vez comete errores, ahora se usa solo para divertirse y entrenar, siempre disponible en la lista de bots. Por favor, no uses IA contra mí a menos que seas una cuenta de bot verificada, serás incluido en la lista negra si lo haces. ¡Diviértete!",
        "it": "Ciao, sono la rete 9*9 con formazione speciale Kata_speed. Gestito da changcheng6541 e xqqzldh. Si muove velocemente e sbaglia raramente, ora viene utilizzato solo per divertimento e allenamento, sempre disponibile nella lista dei bot. Si prega di non usare l'IA contro di me a meno che non siate un account bot verificato, sarete inseriti nella lista nera se lo fate. Divertiti!",
        "ja": "こんにちは、私は Kata_speed 特別に訓練された 9*9 ネットワークです。 changcheng6541 と xqqzldh によって管理されています。動きは速く、失敗することはめったにありません。現在は楽しみとトレーニングのためだけに使用されています。ボット リストでは常に利用可能です。私に対してAIを使用しないでください、検証されたボットアカウントでない限り、そうしないとブラックリストに載ります。楽しんでください。",
        "ko": "안녕하세요. 저는 Kata_speed 특수 훈련 9*9 네트워크입니다. changcheng6541 및 xqqzldh가 관리합니다. 빠르게 움직이고 실수하는 경우가 거의 없으며 이제는 재미와 훈련에만 사용되며 항상 봇 목록에서 사용할 수 있습니다. 저와 함께 AI를 사용하지 마십시오. 검증된 봇 계정이 아닌 경우 블랙리스트에 올라갈 것입니다. 재미있게 보내세요!",
        "nl": "Hallo, ik ben Kata_speed speciaal opgeleid 9*9 netwerk. Beheerd door changcheng6541 en xqqzldh. Beweegt snel en blundert zelden, nu alleen gebruikt voor de lol en training, altijd beschikbaar op de botlijst. Gebruik geen AI tegen mij, tenzij u een geverifieerd botaccount bent, u wordt op de zwarte lijst gezet als u dat doet. Veel plezier!",
        "pl": "Witam, jestem specjalnie przeszkoloną siecią Kata_speed 9*9. Zarządzane przez changcheng6541 i xqqzldh. Porusza się szybko i rzadko popełnia błędy, teraz służy tylko do zabawy i treningu, zawsze dostępny na liście botów. Proszę nie używać AI przeciwko mnie, chyba że masz zweryfikowane konto bota, zostaniesz umieszczony na czarnej liście, jeśli to zrobisz. Baw się dobrze!",
        "pt": "Olá, sou Kata_speed rede 9*9 com treinamento especial. Gerenciado por changcheng6541 e xqqzldh. Move-se rápido e raramente comete erros, agora usado apenas para diversão e treinamento, sempre disponível na lista de bots. Por favor, não use IA contra mim, a menos que você seja uma conta de bot verificada, você será colocado na lista negra se fizer isso. Divirta-se!",
        "ru": "Здравствуйте, я специально обученная сеть 9*9 Kata_speed. Управляется changcheng6541 и xqqzldh. Двигается быстро и редко ошибается, теперь используется только для развлечения и тренировок, всегда доступен в списке ботов. Пожалуйста, не используйте ИИ против меня, если у вас нет подтвержденной учетной записи бота, вы будете внесены в черный список, если сделаете это. Получайте удовольствие!",
        "zh-tw": "大家好，我是Kata_speed專門訓練的9*9網路。由 changcheng6541 和 xqqzldh 管理。移動快速且很少出錯，現在僅用於娛樂和訓練，始終在機器人列表中可用。請不要使用AI對抗我，除非您是經過驗證的機器人帳戶，否則您將被列入黑名單。玩得開心！",
        "zh-cn": "大家好，我是Kata_speed专门训练的9*9网络。由 changcheng6541 和 xqqzldh 管理。移动快速且很少出错，现在仅用于娱乐和训练，始终在机器人列表中可用。请不要使用AI对抗我，除非您是经过验证的机器人账户，否则您将被列入黑名单。玩得开心！",
    }
}